:PROPERTIES:
:ID:       7d192871-be03-434c-90d6-2cf66340dff1
:END:
#+title: python-concurrency
#+startup: overview
#+filetags: :python:thread:aysnc:

*** 继承Thread类来创建任务
#+begin_src python :results output
import threading

class MyThread(threading.Thread):
    def run(self):
        print("Thread beginning")
        print("Doing something")
        print("Thread ending")


thread = MyThread()
thread.start()
thread.join()

print("Main thread ending")
#+end_src

#+RESULTS:
: Thread beginning
: Doing something
: Thread ending
: Main thread ending

*** 异步版
#+begin_src python :results output
import asyncio
import aiohttp
import time

async def fetch_url_async(session: aiohttp.ClientSession, url: str):
    """模拟一个耗时的网络请求（异步版本）"""
    print(f"开始异步获取: {url}")
    # 注意：这里我们使用 aiohttp 的异步 get 方法，并用 await 等待
    async with session.get(url) as response:
        # 模拟处理响应也需要时间
        await asyncio.sleep(2)  # 使用 asyncio.sleep 模拟 I/O 等待，它不会阻塞线程
        text = await response.text()
        print(f"完成异步获取: {url}")
        return f"来自 {url} 的数据 (长度: {len(text)})"


async def main_async():
    urls = [
        "https://httpbin.org/get",
        "https://httpbin.org/delay/1",
        "https://httpbin.org/headers",
    ]

    async with aiohttp.ClientSession() as session:  # 创建异步 HTTP 会话
        # 为每个 URL 创建一个任务（Task）
        tasks = []
        for url in urls:
            # create_task 会将协程加入事件循环，立即开始调度
            task = asyncio.create_task(fetch_url_async(session, url))
            tasks.append(task)

        print("所有任务已创建，开始并发执行...")

        # 使用 asyncio.gather 并发运行所有任务，并等待它们全部完成
        # gather 返回一个结果列表，顺序与传入的任务顺序一致
        results = await asyncio.gather(*tasks)

        return results


if __name__ == "__main__":
    start = time.time()
    # asyncio.run() 是启动事件循环并运行顶层协程的简便方法
    final_results = asyncio.run(main_async())
    end = time.time()

    print(f"\n异步版本总耗时: {end - start:.2f} 秒")
    for res in final_results:
        print(res)
#+end_src

#+RESULTS:
#+begin_example
所有任务已创建，开始并发执行...
开始异步获取: https://httpbin.org/get
开始异步获取: https://httpbin.org/delay/1
开始异步获取: https://httpbin.org/headers
完成异步获取: https://httpbin.org/get
完成异步获取: https://httpbin.org/headers
完成异步获取: https://httpbin.org/delay/1

异步版本总耗时: 4.13 秒
来自 https://httpbin.org/get 的数据 (长度: 312)
来自 https://httpbin.org/delay/1 的数据 (长度: 362)
来自 https://httpbin.org/headers 的数据 (长度: 229)
#+end_example



